{
  "Spiderverse": {
    "title": "Spiderverse",
    "image": "../media/spider-verse.jpeg",
    "date": "November 1, 2020",
    "author": "Akash Kumar",
    "previewContent": "My take on the Spider-Verse rumors",
    "content": [
      "There was an idea to bring together a group of remarkable people... three spidermen! The lineup for MCU's to-be-titled Spider-Man 3 is looking CRAZY. Jamie Foxx is returning as Electro, Doctor Strange will be included, and now Tobey Macguire and Andrew Garfield are rumored to reprise their roles as Spider-Man in the MCU, joining current Spider-Man Tom Holland.",
      "Fans have been pleading for a live-action Spider-Verse for years, and now it may finally happen. I think it would be really cool, and it could work really well with the narrative since Doctor Strange could bring Tobey Macguire and Andrew Garfield in using his magical powers."
    ],
    "winks": "1",
    "comments": [
      {
        "author": "Tony Stark",
        "date": "February 22, 2021",
        "content": "test1",
        "likes": 5
      },
      {
        "author": "Steve Rogers",
        "date": "February 22, 2021",
        "content": "test2",
        "likes": 12
      },
      {
        "author": "Bruce Banner",
        "date": "February 22, 2021",
        "content": "test3"
      },
      {
        "author": "Peter Parker",
        "date": "February 22, 2021",
        "content": "test4"
      }
    ]
  },
  "WandaVision-Leak": {
    "title": "WandaVision-Leak",
    "image": "../media/wanda-vision.jpeg",
    "date": "November 2, 2020",
    "author": "Akash Kumar",
    "previewContent": "What's up with WandaVision?",
    "content": [
      "From WandaVision's trailer, we know that Scarlet Witch is living inside an alternate reality bubble where Vision is still alive, but it looks like the prospect of Marvel multiverse is growing (not to mention the rumors of a Spider-Verse). It is now rumored, by Serlent Pops, that Quicksilver, Wanda's brother will be making an appearance in the much anticipated Disney+ show.",
      "Wandavision has everyone guessing as to the premise of the show. From what we’ve seen so far it appears to mirror some aspects of the Truman Show movie. Wanda and Vision are living a happy suburban life till they begin to notice that not everything seems quite normal as it may appear."
    ],
    "winks": "17",
    "comments": [
      {
        "author": "Tony Stark",
        "date": "March 17, 2021",
        "content": "an amazing show!"
      }
    ]
  },
  "What-If": {
    "title": "What-If",
    "image": "../media/what-if.jpeg",
    "date": "November 3, 2020",
    "author": "Akash Kumar",
    "previewContent": "A preview of Disney+'s upcoming show What If...?",
    "content": [
      "If you are focused on the upcoming movie releases in the Marvel Universe, don’t forget the pretty exciting lineup of TV shows on Disney+. And we are talking about some pretty big budget, tent pole shows. One of the most anticipated shows will release in the summer of 2021. The show is mysteriously called WhatIf…? will explore alternate versions of iconic scenes and moments in the MCU.",
      "Marvel has also lined up an impressive array of actors from the universe to play a role in the new series. These include Michael B. Jordan, Sebastian Stan, Josh Brolin, Mark Ruffalo, Tom Hiddleston, Samuel L. Jackson, Chris Hemsworth, Hayley Atwell, Chadwick Boseman, Karen Gillan, Jeremy Renner, Paul Rudd, Michael Douglas, Neal McDonough, Dominic Cooper, Sean Gunn, Nicole Portman, Stanley Tucci, Taika Waititi, Toby Jones, Djimon Honsou, Michael Rooker, and Jeff Goldblum."
    ],
    "winks": 9,
    "comments": [
      {
        "author": "Tony Stark",
        "date": "March 17, 2021",
        "content": "an amazing show!"
      }
    ]
  },
  "Black-Widow": {
    "title": "Black-Widow",
    "image": "../media/black-widow.jpg",
    "date": "November 5, 2020",
    "author": "Akash Kumar",
    "previewContent": "What ever happened to Black Widow? Will it ever come to the big screens? Click to find out.",
    "content": [
      "Despite the delays of 2020, fans are excited for the Black Widow release in summer of 2021. The cast lineup is getting exciting as well. Florence Pugh will feature as Yelena Belova, a “sister figure” to the Black Widow, and Rachel Weisz as Melina Vostokoff or the Iron Maiden.",
      "There are even some rumors, although still unconfirmed, that claim Robert Downey Jr. may make a surprise cameo appearance in the movie. Finally, or those of you wondering where Black Widow fits within the Marvel timeline, it appears confirmed that Black Widow occurs between Captain America: Civil War and Avengers: Infinity War."
    ],
    "winks": 2,
    "comments": [
      {
        "author": "Tony Stark",
        "date": "March 17, 2021",
        "content": "cool!"
      }
    ]
  },
  "Loki": {
    "title": "Loki",
    "image": "../media/loki.png",
    "date": "November 8, 2020",
    "author": "Akash Kumar",
    "previewContent": "Loki. Need I say anything else?",
    "content": [
      "He’s back! The bad guy that somehow is likeable, AKA Loki is back in the Spring of 2021 on Disney+. The show got a 3-second teaser during the Super Bowl that didn’t give too much away but got fans wanting more. Tom Hiddleston promises that we get to know what he does with the Space Stone after his surprise disappearance at the end of Avengers: Endgame. And Kevin Feige has confirmed that the show connects to the upcoming movie, Doctor Strange in the Multiverse of Madness. Some leaked photos from shooting also hint at the possibility of a Lady Loki played by Sophia Di Martino.",
      "Other actors joining the show include Owen Wilson and Gugu Mbatha-Raw although their characters in the show are yet to be confirmed. What we do know however is that, thanks to the popularity of Loki, a Season 2 has already been commissioned -- even before finishing filming on Season 1. As Loki himself said, “There are no men like me.”"
    ],
    "winks": 4,
    "comments": [
      {
        "author": "Tony Stark",
        "date": "March 17, 2021",
        "content": "an amazing show!"
      }
    ]
  }
}
